 import r1step_1 from "../assets/ricept_1/step_1.webp"
 import r1step_2 from "../assets/ricept_1/step_2.webp"
 import r1step_3 from "../assets/ricept_1/step_3.webp"
 import r1step_4 from "../assets/ricept_1/step_4.webp"
  import r1step_5 from "../assets/ricept_1/step_5.webp"
 import r1step_6 from "../assets/ricept_1/step_6.webp"
 import r1step_7 from "../assets/ricept_1/step_7.webp"
  import r1step_8 from "../assets/ricept_1/step_8.webp"
 import r1step_9 from "../assets/ricept_1/step_9.webp"
 import r1step_10 from "../assets/ricept_1/step_10.webp"
   import r1step_11 from "../assets/ricept_1/step_11.webp"
 import r1step_12 from "../assets/ricept_1/step_12.webp"
 import r1step_13 from "../assets/ricept_1/step_13.webp"
 import r2step_3 from "../assets/recepes/recept_2.webp"
 import r3step_4 from "../assets/recepes/recept_3.webp"

 import r4step_1 from "../assets/ricept_4/step_1.webp"
import r4step_2 from "../assets/ricept_4/step_2.webp"
import r4step_4 from "../assets/ricept_4/step_4.webp"
import r4step_5 from "../assets/ricept_4/step_5.webp"


  import r5step_2 from "../assets/ricept_5/step_2.webp"
 import r5step_6 from "../assets/ricept_5/step_6.webp"
 import r5step_7 from "../assets/ricept_5/step_7.webp"
  import r5step_9 from "../assets/ricept_5/step_9.webp"
   import r5step_11 from "../assets/ricept_5/step_11.webp"
   import image6 from "../assets/recepes/recept_6.webp";
   import image7 from "../assets/recepes/recept_7.webp";


 /* recipeDetails.ts */

export interface Ingredient {
  name: string;   // продукт
  amount?: number; // количество, необязательно (например, "за смаком")
  unit?: string;   // единица измерения
  category?: string;
}

export interface Nutrition {
  name: string; // Калорії, Білки, Жири, Вуглеводи и т.д.
  amount: number;
  unit: string; // г, ккал
}

export interface Step {
  title: string;
  description: string;
  image?: string;
}

export interface RecipeDetails {
  id: string;
  description: string;
  ingredients: Ingredient[];
  steps: Step[];
  calories?: number;
  unit?: string;
  nutrition?: Nutrition[];
  tags?: string[]; // добавляем поле для тегов
}

export const recipeDetails: RecipeDetails[] = [
  {
    id: "r1",
    description:
      "Через стільки років я поділюся з вами приголомшливим рецептом гарбузового пирога! Той, хто вигадав вираз «просто як пиріг», явно ніколи не пек гарбузовий пиріг! Приготуйте ідеальний гарбузовий пиріг з маслянистою, листковою скоринкою та гладкою, без тріщин, начинкою. Це ідеальний святковий десерт!",
       ingredients: [
      { name: "Борошно", amount: 10 , unit: "ст. л.", category: "Бакалія, соуси, горіхи" },
      { name: "Цукровий пісок", amount: 9, unit: "ст. л.", category: "Бакалія, соуси, горіхи" },
      { name: "Сіль", amount: 1, unit: "ч. л.", category: "Бакалія, соуси, горіхи" },
      { name: "Порошок для випічки", amount: 0.125, unit: "ч. л.", category: "Бакалія, соуси, горіхи" },
      { name: "Холодна несолона олія", amount: 0.33, unit: "склянки", category: "Жири/Олія" },
      { name: "Рослинний жир, охолоджений", amount: 3, unit: "ст. л.", category: "Жири/Олія" },
      { name: "Холодна вода", amount: 3, unit: "ст. л.", category: "Напої" },
       { name: "100% гарбузове пюре", amount: 1, unit: "банка", category: "Консервовані овочі" },
       { name: "Яйця", amount: 1, unit: "шт", category: "Молочні продукти та яйця" },
        { name: "Коричневий цукор, злегка упакований", amount: 1.5, unit: "склянки", category: "Бакалія, соуси, горіхи" },
      { name: "Органічна мелена кориця", amount: 1, unit: "ч. л.", category: "Бакалія, соуси, горіхи" },
      { name: "Мелений імбир", amount: 1, unit: "ч. л.", category: "Бакалія, соуси, горіхи" },
      { name: "Мелений мускатний горіх", amount: 0.5, unit: "ч. л.", category: "Бакалія, соуси, горіхи" },
      { name: "Молота гвоздика", amount: 0.125, unit: "ч. л.", category: "Бакалія, соуси, горіхи" },
       { name: "Молотий чорний перець", amount: 0.125, unit: "ч. л.", category: "Бакалія, соуси, горіхи" },
      { name: "Сгущенне молоко", amount: 1.25, unit: "склянки", category: "Консерви" },
    ],
    steps: [
      { title: "Крок перший", description: " Змішайте в кухонному комбайні борошно загального призначення (185 г), цукровий пісок (1 ст. л.), сіль (1/2 ч. л.) та розпушувач (1/8 ч. л.) та подрібніть.", image: r1step_1 },
      { title: "Крок другий", description: "Додайте шматочки несолоної олії (85 г) та рослинного жиру (3 ст. л.) і подрібніть до утворення великої крихти." , image: r1step_2 },
      { title: "Крок третій", description: "Додайте половину води (4 ст. л.) і збивайте кілька разів, щоб перемішати. Додайте воду, що залишилася, і збивайте, поки суміш не стане рівномірно зволоженою і розсипчастою." , image: r1step_3 },
      { title: "Крок четвертий", description: "Викладіть розсипчасте тісто на робочу поверхню і скачайте в кулю. Скачайте з тесту диск діаметром 12 см і загорніть у харчову плівку. Заберіть у холодильник мінімум на 45 хвилин." , image: r1step_4 },
      { title: "Крок п'ятий", description: "Дістаньте тісто з холодильника. Злегка присипте робочу поверхню мукою|борошном| і посипте тісто зверху. Руками обережно вимісіть тісто в гладкий диск, але не перестарайтеся." , image: r1step_5 },
      { title: "Крок шостий", description: "Розкотіть тісто в коло діаметром 30 см. Акуратно накиньте тісто на качалку і перекладіть його у форму для пирога діаметром 23 см (глибиною не менше 3 см). Акуратно покладіть тісто у форму, злегка втискаючи його всередину. Якщо воно порветься, негайно зашийте його." , image: r1step_6 },
      { title: "Крок сьомий", description: "Обрежьте края, выступая на 1,2 см за край формы. Подверните края, чтобы сформировать бортик, затем прижмите бортик к краю формы, чтобы получился ровный край. В завершение защипните бортик пальцами.", image: r1step_7 },
      { title: "Крок восьмий", description: "Заморозьте основу як мінімум на 15 хвилин, поки духовка розігрівається до 375 градусів за Фаренгейтом (190 градусів за Цельсієм).", image: r1step_8 },
       { title: "Крок дев'ятий", description: "Дістаньте основу для пирога з морозилки і покладіть на деко. Накрийте основу пергаментним папером, наповніть приблизно наполовину сухою квасолею або грузиками для пирога і випікайте 25 хвилин." , image: r1step_9 },
      { title: "Крок десятий", description: "Дістаньте основу з духовки, зніміть пергаментний папір і квасолю або обтяжувачі для пирогів, притисніть краї, щоб вони не потемніли. Випікайте ще 20 хвилин|мінути| або до тих пір, поки|доки| тісто не стане сухим і золотистим. Якщо низ підніметься, акуратно притисніть його лопаткою." , image: r1step_10},
      { title: "Крок одинадцятий", description: "Зніміть основу для пирога та фольгу. Зменшіть температуру духовки до 160°C (325°F). Для приготування начинки збийте у великій мисці 100% гарбузове пюре (1 банка), велике коричневе яйце Farmhouse Eggs® (1), жовтки великих коричневих яєць Farmhouse Eggs® (3), цукровий пісок (100 г), коричневий цукор (110 г), п2. ч. л.), мелену корицю Simply Organic (1 ч. л.), мелений імбир (1 ч. л.), мелений мускатний горіх (1/2 ч. л.), мелену гвоздику (1/8 ч. л.), мелений чорний перець (1/0) мл)." , image: r1step_11},
      { title: "Крок дванадцятий", description: "Вилийте суміш у попередньо випечений корж і випікайте 50-60 хвилин." , image: r1step_12},
      { title: "Крок тринадцятий", description: "Остудіть пиріг на деку або решітці протягом кількох годин. Наріжте та поставте в холодильник до подачі." , image: r1step_13 },
    ],
    nutrition: [
      { name: "Калорії", amount: 428, unit: "ккал" },
      { name: "Білки", amount: 9, unit: "г" },
      { name: "Жири", amount: 18.7, unit: "г" },
      { name: "Вуглеводи", amount: 55.6, unit: "г" },
    ],
    tags: ["основна_страва", "на_обід", "тушковане", "швидкі_рецепти", "низькокалорійне", "низькокалорійне"], // добавляем теги
  },
  {
    id: "r2",
    description:
      "Вірусне морозиво з сиру спричинило фурор в інтернеті в 2024 році... і не дарма! Його дуже легко приготувати — всього 10 хвилин, і морожениця не потрібна, а насичений сир замінює жирні вершки. Завдяки банану, який надає цьому чізкейку додаткову насиченість, це морозиво, натхнене чізкейком, виходить вишуканим, фруктовим, солодким та чудовим.",
    ingredients: [
      { name: "Сир", amount: 2, unit: "чашки", category: "Молочні продукти та яйця" },
      { name: "Банан", amount: 1, unit: "шт", category: "Овочі та фрукти"},
      { name: "Свіжа полуниця, нарізана кубиками, розділена на частини", amount: 1.5, unit: "склянки", category: "Овочі та фрукти" },
      { name: "Мед", amount: 4, unit: "ст. л." , category: "Бакалія, соуси, горіхи"},
      { name: "Подрібнені крекери Грема", amount: 0.5, unit: "склянки", category: "Бакалія, соуси, горіхи"},
    ],
    steps: [
      { title: "Крок перший", description: "У блендері змішайте сир (2 склянки), банан (1), склянки свіжої полуниці (1 1/2 склянки), мед (4 ст. л.) і екстракт ванілі Simply Organic (1 ч. л.) до отримання однорідної маси." },
      { title: "Крок другий", description: "Перелийте в контейнер, що підходить для заморожування, і додайте нарізану кубиками полуницю і крекери «Грехем» (1/2 склянки), що залишилася." },
      { title: "Крок третій", description: "Заморозьте примерно на 4 часа, до полного застывания. Дайте оттаять 5–10 минут при комнатной температуре, прежде чем набирать и подавать.", image: r2step_3  },
    ],
    nutrition: [
      { name: "Калорії", amount: 274, unit: "ккал" },
      { name: "Білки", amount: 13.9, unit: "г" },
      { name: "Жири", amount: 6, unit: "г" },
      { name: "Вуглеводи", amount: 41.6, unit: "г" },
    ],
    tags: ["Десерт", "Швидко", "Солодке"], // добавляем теги
  },

    {
    id: "r3",
    description:
      "Цей вірусний киш із тортильї став сенсацією у соціальних мережах — і не безпідставно. Це швидка, багата на білком страва, що ідеально підходить для відновлення після тренування. Просто викладіть цільнозернову тортилью у форму для випічки, наповніть її яйцями Eggland's Best та вашими улюбленими інгредієнтами та запікайте до золотистої скоринки. У кожній порції міститься близько 20 г енергетичних вуглеводів та майже 30 г білка, що відновлює м'язи.",
    ingredients: [
      { name: "Яйце", amount: 2, unit: "шт.", category: "Молочні продукти та яйця" },
      { name: "Сир", amount: 4, unit: "ст. л.", category: "Молочні продукти та яйця"},
      { name: "Цільнозернова тортилья", amount: 1, unit: "шт.", category: "Хлібобулочні вироби" },
      { name: "Свіжий молодий шпинат", amount: 0.5, unit: "склянки" , category: "Овочі та фрукти"},
      { name: "Копчений сир чеддер", amount: 2, unit: "ст. л.", category: "Молочні продукти та яйця"},
    ],
    steps: [
      { title: "Крок перший", description: "Розігрійте аерофритюрницю до 325 градусів за Фаренгейтом (170 градусів за Цельсієм)." },
      { title: "Крок другий", description: "Збийте разом яйця (2 шт.) та сир (4 ст. л.)." },
      { title: "Крок третій", description: "Викладіть цільнозернову тортилью (1) у круглу форму для випічки, надавши їй форму чаші, залийте яєчною сумішшю, зверху посипте свіжим молодим шпинатом (1/2 склянки) та копченим сиром чеддер (2 ст. л.)." },
      { title: "Крок четвертий", description: "Готуйте 12 хвилин, поки яйце не застигне, а сир не розплавиться." , image: r3step_4 },
    ],
    nutrition: [
      { name: "Калорії", amount: 340, unit: "ккал" },
      { name: "Білки", amount: 25, unit: "г" },
      { name: "Жири", amount: 19.1, unit: "г" },
      { name: "Вуглеводи", amount: 17.2, unit: "г" },
    ],
    tags: ["Десерт", "Швидко", "Солодке"], // добавляем теги
  },
  {
      id: "r4",
    description:
      "Така збалансована страва з великою кількістю зелені, корисних жирів і білка. Замініть свинячий фарш тунцем, а для веганського варіанта візьміть тофу!",
    ingredients: [
      { name: "Велика цибуля, нарізана", amount: 0.25, unit: "шт.", category: "Овочі та фрукти" },
      { name: "95/5 пісний свинячий фарш", amount: 156, unit: "г", category: "М'ясо"},
      { name: "Сіль", unit: "за смаком", category: "Бакалія, соуси, горіхи" },
      { name: "Молотий чорний перець", unit: "за смаком" , category: "Бакалія, соуси, горіхи"},
      { name: "Біле сухе вино", amount: 4, unit: "ст. л.", category: "Алкогольні напої"},
      { name: "Великі цукіні", amount: 1, unit: "шт.", category: "Овочі та фрукти"},
      { name: "Песто з цукіні", amount: 2, unit: "ст. л.", category: "Бакалія, соуси, горіхи" },
      { name: "Свіжий базилік", unit: "за смаком" , category: "Овочі та фрукти"},
      { name: "Оливкова олія першого віджиму", amount: 1, unit: "ч. л.", category: "Жири/Олія"},
      
    ],
    steps: [
      { title: "Крок перший", description: "Додайте|добавляйте| цибулю (1/4) і обсмажте її на сковороді з оливковою олією першого холодного віджиму (1 ч. л.) до м'якості.", image: r4step_1 },
      { title: "Крок другий", description: "Додайте фарш із пісної свинини 95/5 (150 г), приправте сіллю (на смак) і меленим чорним перцем (на смак) і готуйте на середньому вогні 3–5 хвилин або до напівготовності м'яса.", image: r4step_2 },
      { title: "Крок третій", description: "Влийте біле сухе вино (4 ст. л.) і дайте рідині випаруватися. Зніміть з вогню та відставте убік."},
      { title: "Крок четвертий", description: "Тим часом поверніть цукіні (1) в локшину спіраллю і додайте її до сковороди до свинячого фаршу разом з песто з цукіні (2 ст. л.). Перемішуйте, поки цукіні не покриються соусом. Додати трохи меленого чорного перцю." , image: r4step_4 },
       { title: "Крок п'ятий", description: "Подавайте на стіл, додавши трохи свіжого базиліка (за смаком). Приємного апетиту!" , image: r4step_5 }
    ],
    nutrition: [
      { name: "Калорії", amount: 669, unit: "ккал" },
      { name: "Білки", amount: 44, unit: "г" },
      { name: "Жири", amount: 45.9, unit: "г" },
      { name: "Вуглеводи", amount: 12.4, unit: "г" },
    ],
    tags: ["Десерт", "Швидко", "Солодке"], // добавляем теги
  },

  {
      id: "r5",
    description:
      "У цьому курячому ескабечі є всі смаки, які потрібні для ситної страви: терпкий, солодкий, пряний, пікантний та свіжий. Це простий рецепт курячих стегон, що підійде як для вечері в будній день, так і для вишуканої вечері.",
    ingredients: [
      { name: "Курячі стегна.", amount: 1, unit: "шт.", category: "М'ясо" },
      { name: "Насіння кмину", amount: 1, unit: "ст. л.", category: "Бакалія, соуси, горіхи"},
      { name: "Мелений коріандр", amount: 1, unit: "ч. л.", category: "Бакалія, соуси, горіхи" },
      { name: "Оливкова олія", amount: 0.33 , unit: "склянки" , category: "Жири/Олія"},
      { name: "Середня цибуля, нарізана", amount: 1, unit: "шт.", category: "Овочі та фрукти"},
      { name: "Морква, очищена, нарізана", amount: 1, unit: "шт.", category: "Овочі та фрукти"},
      { name: "Часник, подрібнений", amount: 6, unit: "зубчаків", category: "Овочі та фрукти" },
      { name: "Лавровий лист", amount: 1, unit: "шт." , category: "Бакалія, соуси, горіхи"},
      { name: "Хересний оцет", amount: 0.65, unit: "склянки", category: "Бакалія, соуси, горіхи"},
      { name: "Вода", amount: 0.5, unit: "склянки", category: "Напої" },
      { name: "Перець халапеньо, тонко нарізаний", amount: 1, unit: "шт." , category: "Овочі та фрукти"},
      { name: "Свіже листя м'яти", amount: 0.75, unit: "склянки", category: "Бакалія, соуси, горіхи"},
      
    ],
    steps: [
      { title: "Крок перший", description: "Розігрійте духовку до 400 градусів за Фаренгейтом (200 градусів за Цельсієм)."},
      { title: "Крок другий", description: "Покладіть ізюм Sun-Maid (1/2 склянки) у миску з нереактивного матеріалу, стійку до нагрівання. Додайте туди перець халапеньо (1) і родзинки і відставте вбік.", image: r5step_2 },
      { title: "Крок третій", description: "Курячі стегна (6) посоліть і поперчіть з обох боків та під шкірою. Промокніть шкіру насухо і відкладіть убік."},
      { title: "Крок четвертий", description: "Поставте велику сковороду на середній вогонь. Обсмажте насіння кмину (1 ст. л.) та мелений коріандр (1 ч. л.) до появи аромату та розкриття спецій (близько 1 хвилини)." },
       { title: "Крок п'ятий", description: "Додайте оливкову олію (1/3 склянки) і змішайте зі спеціями. Додайте моркву (1 шт.), Цибулю (1 шт.), Часник (6 зубчиків) і готуйте, поки цибуля не стане прозорою, але не потемніє. 5-8 хвилин."  },
         { title: "Крок шостий", description: "Добавьте хересный уксус (2/3 стакана), воду (1/2 стакана), лавровый лист (1 шт.) и доведите смесь до кипения. Уменьшите огонь и варите на медленном огне около 1 минуты.", image: r5step_6 },
      { title: "Крок сьомий", description: "Видаліть лавровий лист і вилийте суміш у миску з халапеньо та родзинками. Перемішайте.", image: r5step_7 },
      { title: "Крок восьмий", description: "Протріть сковороду та поставте на середній вогонь, додайте 2 столові ложки оливкової олії. Коли олія нагріється, покладіть курку шкірою донизу. Найкраще готувати порціями по 3-4 шматки курки за раз. Готуйте, доки шкіра не стане хрусткою, близько 8 хвилин." },
       { title: "Крок дев'ятий", description: "Коли скоринка стане хрусткою, переверніть курку і готуйте ще з хвилини з іншого боку. Відкладіть курку убік." , image: r5step_9 },
       { title: "Крок десятий", description: "Поверніть оцтову суміш у каструлю, помішуючи та зішкрібаючи залишки фаршу з дна. Знову покладіть всю курку в каструлю і поставте в духовку без кришки приблизно на 15 хвилин, поки курка не приготується."  },
       { title: "Крок одинадцятий", description: "Выньте из духовки и дайте курице остыть примерно 15 минут. Посыпьте сверху листьями свежей мяты (3/4 стакана) и подавайте." , image: r5step_11 },
    ],
    nutrition: [
      { name: "Калорії", amount: 468, unit: "ккал" },
      { name: "Білки", amount: 35.1, unit: "г" },
      { name: "Жири", amount: 25.4, unit: "г" },
      { name: "Вуглеводи", amount: 25.4, unit: "г" },
    ],
    tags: ["Десерт", "Швидко", "Солодке"], // добавляем теги
  },
   {
      id: "r6",
    description:
      "Ці солодкі кекси стануть чудовим сніданком у дорозі!",
    ingredients: [
      { name: "Яйце", amount: 2, unit: "шт.", category: "Молочні продукти та яйця" },
      { name: "Борошно загального призначення", amount: 3, unit: "ст. л.", category: "Бакалія, соуси, горіхи"},
      { name: "Порошок для випічки", amount: 1.33, unit: "ст. л.", category: "Бакалія, соуси, горіхи" },
      { name: "Сіль", amount: 1, unit: "ч. л." , category: "Бакалія, соуси, горіхи"},
      { name: "Цукровий пісок", amount: 1, unit: "чашка", category: "Бакалія, соуси, горіхи"},
      { name: "Мигдальне молоко", amount: 1, unit: "чашка", category: "Молочні продукти та яйця"},
      { name: "Оливкова олія", amount: 0.5, unit: "склянки", category: "Жири/Олія" },
      { name: "Просто органічний екстракт ванілі", amount: 0.5, unit: "ч. л." , category: "Бакалія, соуси, горіхи"},
      { name: "Екстракт мигдалю", amount: 0.5, unit: "ч. л.", category: "Бакалія, соуси, горіхи"},
      { name: "Темна шоколадна крихта", amount: 1, unit: "чашка" , category: "Бакалія, соуси, горіхи"},
      { name: "Рубаний смажений мигдаль", amount: 1, unit: "чашка", category: "Бакалія, соуси, горіхи"},
      
    ],
    steps: [
      { title: "Крок перший", description: "Розігрійте духовку до 375 градусів за Фаренгейтом (190 градусів за Цельсієм)." },
      { title: "Крок другий", description: "Підготуйте велику форму для кексів об'ємом 6 склянок, вистеливши її паперовими вкладками або використовуючи антипригарний спрей без вкладок." },
      { title: "Крок третій", description: "У великій мисці змішайте борошно загального призначення (3 склянки), розпушувач (1 1/3 ст. л.) та сіль (1 ч. л.) і відставте убік."},
      { title: "Крок четвертий", description: "В средней миске взбейте яйца Eggland's Best Pasture Raised (2 шт.) и сахарный песок (1 стакан) до однородной массы. Добавьте миндальное молоко (1 стакан), оливковое масло (1/2 стакана), экстракт ванили Simply Organic (1/2 ч. л.) и миндальный экстракт (1/2 ч. л.)." },
      { title: "Крок п'ятий", description: "Додайте рідкі інгредієнти в сухі і акуратно перемішайте, включаючи всі інгредієнти."},
      { title: "Крок шостий", description: "Додайте шматочки темного шоколаду (1 склянку), подрібнений смажений мигдаль (1 склянку) і перемішайте."},
      { title: "Крок сьомий", description: "Розлийте тісто за формами для мафінів, заповнюючи їх приблизно на ¾. Випікайте 35 хвилин або доти, поки зубочистка, вставлена ​​в центр маффінів, не виходитиме чистою, а верхівки не набудуть золотистого відтінку." },
      { title: "Крок восьмий", description: "Остудите в течение 15 минут и подавайте.", image: image6}
    ],
    nutrition: [
      { name: "Калорії", amount: 789, unit: "ккал" },
      { name: "Білки", amount: 14.5, unit: "г" },
      { name: "Жири", amount: 34.7, unit: "г" },
      { name: "Вуглеводи", amount: 106.5, unit: "г" },
    ],
    tags: ["Десерт", "Швидко", "Солодке"], // добавляем теги
  },
 {
      id: "r7",
    description:
      "Якщо ви шукаєте смачний, корисний та простий у приготуванні рецепт салату, цей грецький салат із нутом – те, що вам потрібно! Він містить усі ваші улюблені середземноморські інгредієнти: огірки, помідори, зелень та оливки. Він заправлений легкою та ароматною заправкою з оливкової олії та червоного винного оцту. Цей салат обов'язково сподобається всім та ідеально підійде для барбекю, спільних обідів та легких вечерь у будні дні!",
    ingredients: [
      { name: "Нут, злити воду, промити", amount: 2, unit: "банки", category: "Бакалія, соуси, горіхи" },
      { name: "Помідори чері, розрізані на четвертинки", amount: 1.5, unit: "склянки", category: "Овочі та фрукти"},
      { name: "Огірок, нарізаний кубиками", amount: 1.5, unit: "шт.", category: "Овочі та фрукти" },
      { name: "Маленька червона цибуля, крупно нарізана", amount: 1, unit: "шт." , category: "Овочі та фрукти"},
      { name: "Нарізані оливки Каламата", amount: 0.5, unit: "стакана", category: "Овочі та фрукти"},
      { name: "Сир фета", amount: 1, unit: "банка", category: "Молочні продукти та яйця"},
      { name: "Часник, дрібно нарізаний", amount: 2, unit: "зубчика", category: "Овочі та фрукти" },
      { name: "Сушений орегано", amount: 2, unit: "ст. л." , category: "Бакалія, соуси, горіхи"},
      { name: "Оливкова олія", amount: 4, unit: "ст. л.", category: "Жири/Олія"},
      { name: "Червоний винний оцет", amount: 0.5, unit: "склянки", category: "Бакалія, соуси, горіхи"},
      { name: "Сіль", amount: 1, unit: "ч. л.", category: "Бакалія, соуси, горіхи"},
      { name: "Подрібнене свіже листя м'яти", unit: "за смаком", category: "Бакалія, соуси, горіхи"},
      { name: "Рубана італійська плоска петрушка", unit: "за смаком", category: "Бакалія, соуси, горіхи"},
    ],
    steps: [
      { title: "Крок перший", description: "У велику салатницю покладіть помідори чері (1,5 склянки), нут (2 банки), огірок (1 шт.), червону цибулю (1 шт.), оливки каламату (1/2 склянки), розкришений сир фета (1 упаковка), часник (2 зубчики), сушений орегано. віджиму (4 ст. л.), червоний винний оцет (1/2 склянки) та сіль (1 ч. л.). Добре перемішайте."},
      { title: "Крок другий", description: "Прикрасьте листям свіжої м'яти (за смаком) та італійською петрушкою (за смаком). Насолоджуйтесь негайно!", image: image7 }
    ],
    nutrition: [
      { name: "Калорії", amount: 519, unit: "ккал" },
      { name: "Білки", amount: 21.8, unit: "г" },
      { name: "Жири", amount: 28.8, unit: "г" },
      { name: "Вуглеводи", amount: 45.4, unit: "г" },
    ],
    tags: ["Десерт", "Швидко", "Солодке"], // добавляем теги
  },

  {
  id: "r8",
  description:
    "Цей освіжаючий салат з огірком, йогуртом, лимоном та спеціями — легкий, корисний і дуже смачний. Ідеально підходить як гарнір або легка страва для спекотного дня. Грецький йогурт додає кремовості, лимон — свіжості, а зелень та спеції роблять смак насиченим.",
  ingredients: [
    { name: "Огірок", amount: 1, unit: "шт.", category: "Овочі та фрукти" },
    { name: "Звичайний грецький йогурт", amount: 0.5, unit: "склянки", category: "Молочні продукти та яйця" },
    { name: "Лимон, свіжовичавлений", amount: 2, unit: "ч. л. соку (на 2 порції)", category: "Овочі та фрукти" },
    { name: "Часник, дрібно нарізаний", amount: 1, unit: "зубчик", category: "Овочі та фрукти" },
    { name: "Свіжий кріп, нарізаний", amount: 1, unit: "ч. л.", category: "Овочі та фрукти" },
    { name: "Сіль", unit: "за смаком", category: "Бакалія, соуси, горіхи" },
    { name: "Мелений чорний перець", unit: "за смаком", category: "Бакалія, соуси, горіхи" },
    { name: "Болгарський перець, нарізаний кубиками", amount: 0.5, unit: "шт.", category: "Овочі та фрукти" },
    { name: "Червона цибуля, нарізана кубиками", amount: 4, unit: "ст. л.", category: "Овочі та фрукти" },
    { name: "Сир фета, розкришений", amount: 4, unit: "ст. л.", category: "Молочні продукти та яйця" },
  ],
  steps: [
    { title: "Крок перший", description: "У мисці змішайте йогурт, лимонний сік, часник, кріп, сіль та чорний перець." },
    { title: "Крок другий", description: "Додайте огірок, болгарський перець та червону цибулю. Перемішайте." },
    { title: "Крок третій", description: "Прикрасьте розкришеним сиром фета перед подачею." }
  ],
  nutrition: [
    { name: "Калорії", amount: 164, unit: "ккал" },
    { name: "Білки", amount: 10.9, unit: "г" },
    { name: "Жири", amount: 7.9, unit: "г" },
    { name: "Вуглеводи", amount: 15.3, unit: "г" },
  ],
  tags: ["Салат", "Легко", "Свіже"],
}

  

];

