 /* recipeDetails.ts */
export interface Ingredient {
  name: string;   // продукт
  amount?: number; // количество, необязательно (например, "за смаком")
  unit?: string;   // единица измерения
  category?: string;
}

export interface Nutrition {
  name: string; // Калорії, Білки, Жири, Вуглеводи и т.д.
  amount: number;
  unit: string; // г, ккал
}

export interface Step {
  title: string;
  description: string;
  image?: string;
}

export interface RecipeDetails {
  id: string;
  description: string;
  ingredients: Ingredient[];
  steps: Step[];
  calories?: number;
  unit?: string;
  nutrition?: Nutrition[];
  tags?: string[]; // добавляем поле для тегов
}

export const recipeDetails: RecipeDetails[] = [
  {
    id: "r1",
    description:
      "Це легка, соковита і ситна страва, яка швидко готується і підійде як для обіду, так і для вечері. Ідеально поєднується зі свіжою зеленню та може подаватися самостійно або як гарнір до картоплі чи круп.",
       ingredients: [
      { name: "Молода капуста", amount: 200, unit: "г", category: "Овочі та зелень" },
      { name: "Куряче філе", amount: 120, unit: "г", category: "М’ясо та риба" },
      { name: "Помідори", amount: 100, unit: "г", category: "Овочі та зелень" },
      { name: "Твердий сир", amount: 50, unit: "г", category: "Молочні продукти та яйця " },
      { name: "Рослинна олія або вершкове масло", amount: 1, unit: "ст. л.", category: "Жири/Олія" },
      { name: "Сіль", unit: "за смаком", category: "Спеції" },
      { name: "Зелень (петрушка/кріп)", unit: "для подачі", category: "Овочі та зелень" },
    ],
    steps: [
      { title: "Підготовка овочів", description: " Для початку капусту тонко нашаткуйте, цибулю наріжте акуратними кубиками, помідори поріжте на середні шматочки, а часник подрібніть — так овочі рівномірно приготуються та віддадуть страві максимум смаку." },
      { title: "Обсмажування курки", description: "Куряче філе наріжте невеликими шматочками. У глибокій сковороді або казані розігрійте трохи олії та викладіть курку. Обсмажуйте її 5–7 хвилин до золотистої скоринки, не забуваючи посолити та поперчити — так м’ясо буде соковитим і ароматним." },
      { title: "Додавання овочів", description: "Додайте до курки цибулю та часник і обсмажуйте ще близько 2 хвилин, щоб вони віддали страві аромат. Потім додайте капусту, добре перемішайте і готуйте під кришкою на середньому вогні приблизно 10 хвилин, поки капуста стане м’якою та соковитою." },
      { title: "Томати та сир", description: "Додайте порізані помідори і тушкуйте ще приблизно 5 хвилин, щоб вони віддали страві соковитість. Потім добре перемішайте і посипте натертим сиром, накрийте кришкою на 2–3 хвилини, щоб сир розплавився і створив апетитну ароматну скоринку." },
      { title: "Подача", description: "Страву посипте свіжою зеленню і подавайте гарячою — вона чудово смакує як самостійна страва або як гарнір до картоплі чи круп." },
    ],
    nutrition: [
      { name: "Калорії", amount: 180, unit: "ккал" },
      { name: "Білки", amount: 5, unit: "г" },
      { name: "Жири", amount: 10, unit: "г" },
      { name: "Вуглеводи", amount: 20, unit: "г" },
    ],
    tags: ["основна_страва", "на_обід", "тушковане", "швидкі_рецепти", "низькокалорійне", "низькокалорійне"], // добавляем теги
  },
  {
    id: "r2",
    description:
      "Ароматна шарлотка з ніжним сирним смаком і яблучними скибочками.",
    ingredients: [
      { name: "Яблука", amount: 4, unit: "шт.", category: "Фрукти" },
      { name: "Сир", amount: 200, unit: "г", category: "Молочні продукти та яйця "},
      { name: "Яйця", amount: 3, unit: "шт.", category: "Молочні продукти та яйця " },
      { name: "Цукор", amount: 150, unit: "г" , category: "Бакалія, соуси, горіхи "},
      { name: "Борошно", amount: 250, unit: "г", category: "Бакалія, соуси, горіхи "},
    ],
    steps: [
      { title: "Підготовка капусти", description: "Нашаткувати капусту." },
      { title: "Нарізка помідорів", description: "Нарізати помідори кубиками." },
      { title: "Обсмажування", description: "Обсмажити овочі на олії." },
      { title: "Тушкування", description: "Тушкувати 20 хв до готовності." },
    ],
    calories: 320,
    nutrition: [
      { name: "Калорії", amount: 320, unit: "ккал" },
      { name: "Білки", amount: 6, unit: "г" },
      { name: "Жири", amount: 12, unit: "г" },
      { name: "Вуглеводи", amount: 45, unit: "г" },
    ],
    tags: ["Десерт", "Швидко", "Солодке"], // добавляем теги
  },

    {
    id: "r3",
    description:
      "Ароматна шарлотка з ніжним сирним смаком і яблучними скибочками.",
    ingredients: [
      { name: "Яблука", amount: 4, unit: "шт.", category: "Фрукти" },
      { name: "Сир", amount: 200, unit: "г", category: "Молочні продукти та яйця "},
      { name: "Яйця", amount: 3, unit: "шт.", category: "Молочні продукти та яйця " },
      { name: "Цукор", amount: 150, unit: "г" , category: "Бакалія, соуси, горіхи "},
      { name: "Борошно", amount: 250, unit: "г", category: "Бакалія, соуси, горіхи "},
    ],
    steps: [
      { title: "Підготовка капусти", description: "Нашаткувати капусту." },
      { title: "Нарізка помідорів", description: "Нарізати помідори кубиками." },
      { title: "Обсмажування", description: "Обсмажити овочі на олії." },
      { title: "Тушкування", description: "Тушкувати 20 хв до готовності." },
    ],
    calories: 320,
    nutrition: [
      { name: "Калорії", amount: 320, unit: "ккал" },
      { name: "Білки", amount: 6, unit: "г" },
      { name: "Жири", amount: 12, unit: "г" },
      { name: "Вуглеводи", amount: 45, unit: "г" },
    ],
    tags: ["Десерт", "Швидко", "Солодке"], // добавляем теги
  },
  
];

